//for (выражение,выражение,выражение) инструкция або по правильному
//for (инициализацыя,тест,инкремент) тело цикла 
// тобто йде ініціалізація счетчика, потім його перевірка і потім його якесь обновлення 
// будь-який вираз з чотирьох можна прорстити якщо він не потрібний

let x;
for (x=2;x<20;x+=4) {
    console.log(x);
}
console.log(x);


//while (виражения) инструкция
let i = 4;
while(i<20) {
    console.log(i+=3);
}



//do инсрукция while (виражение)
let z=2;
do (console.log(z+=3)); while (z<20);
//в такому типі цикла навіть якщо умова не буде виконана всеодно буде виконаний перший цикл 
//тому що свєрхразумна логіка робить цикл до перевірки кек